#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"]: Refreshing state... [id=bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8]
module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group.admin: Refreshing state... [id=cdfeff16-cc12-4f6b-af9b-21a0c3638850]
module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings: Refreshing state... [id=bcparks-service-transformation/cdfeff16-cc12-4f6b-af9b-21a0c3638850]
module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"]: Refreshing state... [id=bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8]
module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group.viewer: Refreshing state... [id=552c0a44-4834-4071-8585-9fe2e6ea45d8]
module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"]: Refreshing state... [id=bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8]
module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"]: Refreshing state... [id=bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8]
module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"]: Refreshing state... [id=bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8]
module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"]: Refreshing state... [id=bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8]
module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"]: Refreshing state... [id=bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276]
module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group.admin: Refreshing state... [id=880ce9ff-f787-4de3-80b4-8dcb09202387]
module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group.viewer: Refreshing state... [id=f48b403d-e1de-4b00-8984-92d4ea334276]
module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings: Refreshing state... [id=bcparks-service-transformation/880ce9ff-f787-4de3-80b4-8dcb09202387]
module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"]: Refreshing state... [id=bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276]
module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"]: Refreshing state... [id=bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276]
module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"]: Refreshing state... [id=bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276]
module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"]: Refreshing state... [id=bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276]
module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"]: Refreshing state... [id=bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276]
module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings: Refreshing state... [id=bcparks-service-transformation/1500a076-d70e-48ac-a716-9a6154cd2813]
module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"]: Refreshing state... [id=bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458]
module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group.viewer: Refreshing state... [id=e88ed69a-b813-4a0a-bac4-acbcc9113458]
module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"]: Refreshing state... [id=bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458]
module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"]: Refreshing state... [id=bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458]
module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group.admin: Refreshing state... [id=1500a076-d70e-48ac-a716-9a6154cd2813]
module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"]: Refreshing state... [id=bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458]
module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"]: Refreshing state... [id=bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458]
module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"]: Refreshing state... [id=bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group.admin has changed
  ~ resource "keycloak_group" "admin" {
      + attributes = {}
        id         = "1500a076-d70e-48ac-a716-9a6154cd2813"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group.viewer has changed
  ~ resource "keycloak_group" "viewer" {
      + attributes = {}
        id         = "e88ed69a-b813-4a0a-bac4-acbcc9113458"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458"
      ~ role_ids   = [
          + "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          - "aac399e2-4bb0-47ab-bca3-6b3c51611774",
          + "df526cab-673e-4fb2-89e5-83c34a572a05",
          + "df5e19ad-8ee6-4e23-93df-f7960abfc055",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458"
      ~ role_ids   = [
          - "88f92d8c-0ac3-42d0-a897-1c2c9f20b3d2",
          + "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          + "df526cab-673e-4fb2-89e5-83c34a572a05",
          + "df5e19ad-8ee6-4e23-93df-f7960abfc055",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458"
      ~ role_ids   = [
          + "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          + "df5e19ad-8ee6-4e23-93df-f7960abfc055",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458"
      ~ role_ids   = [
          + "df526cab-673e-4fb2-89e5-83c34a572a05",
          + "df5e19ad-8ee6-4e23-93df-f7960abfc055",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458"
      ~ role_ids   = [
          - "5b4245ba-87fb-4950-88a8-edc54a9a9fef",
          + "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          + "df526cab-673e-4fb2-89e5-83c34a572a05",
          + "df5e19ad-8ee6-4e23-93df-f7960abfc055",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458"
      ~ role_ids   = [
          + "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          + "df526cab-673e-4fb2-89e5-83c34a572a05",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "bcparks-service-transformation"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group.admin has changed
  ~ resource "keycloak_group" "admin" {
      + attributes = {}
        id         = "cdfeff16-cc12-4f6b-af9b-21a0c3638850"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group.viewer has changed
  ~ resource "keycloak_group" "viewer" {
      + attributes = {}
        id         = "552c0a44-4834-4071-8585-9fe2e6ea45d8"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8"
      ~ role_ids   = [
          + "9cabf49f-64b4-44a6-b54d-269cef349426",
          - "de904d29-9d89-416a-a111-37d866752578",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8"
      ~ role_ids   = [
          + "9cabf49f-64b4-44a6-b54d-269cef349426",
          - "dc1ca701-e1aa-47a4-8f7a-cffa2b154859",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8"
      ~ role_ids   = [
          - "8f1bbd70-0979-473e-bf55-43c3a3eb147d",
          + "9cabf49f-64b4-44a6-b54d-269cef349426",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8"
      ~ role_ids   = [
          - "20edab20-5d45-40a4-bae2-376df4e5f2c3",
          + "9cabf49f-64b4-44a6-b54d-269cef349426",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8"
      ~ role_ids   = [
          + "9cabf49f-64b4-44a6-b54d-269cef349426",
          - "c6d32d04-182b-4f62-a386-df61d4b1fbba",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "bcparks-service-transformation"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group.admin has changed
  ~ resource "keycloak_group" "admin" {
      + attributes = {}
        id         = "880ce9ff-f787-4de3-80b4-8dcb09202387"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group.viewer has changed
  ~ resource "keycloak_group" "viewer" {
      + attributes = {}
        id         = "f48b403d-e1de-4b00-8984-92d4ea334276"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276"
      ~ role_ids   = [
          + "255faa28-f3d6-4d57-8514-4360bb69931f",
          + "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          + "44187847-e30c-4161-90dc-4f62816c4437",
          + "5a727130-8191-496d-83b7-1a81da9b54ff",
          + "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276"
      ~ role_ids   = [
          + "255faa28-f3d6-4d57-8514-4360bb69931f",
          + "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          + "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          + "5a727130-8191-496d-83b7-1a81da9b54ff",
          + "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276"
      ~ role_ids   = [
          + "255faa28-f3d6-4d57-8514-4360bb69931f",
          + "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          + "44187847-e30c-4161-90dc-4f62816c4437",
          + "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          + "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276"
      ~ role_ids   = [
          + "255faa28-f3d6-4d57-8514-4360bb69931f",
          + "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          + "44187847-e30c-4161-90dc-4f62816c4437",
          + "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          + "5a727130-8191-496d-83b7-1a81da9b54ff",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276"
      ~ role_ids   = [
          + "255faa28-f3d6-4d57-8514-4360bb69931f",
          + "44187847-e30c-4161-90dc-4f62816c4437",
          + "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          + "5a727130-8191-496d-83b7-1a81da9b54ff",
          + "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276"
      ~ role_ids   = [
          + "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          + "44187847-e30c-4161-90dc-4f62816c4437",
          + "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          + "5a727130-8191-496d-83b7-1a81da9b54ff",
          + "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "bcparks-service-transformation"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group.admin will be destroyed
  # (because keycloak_group.admin is not in configuration)
  - resource "keycloak_group" "admin" {
      - attributes = {} -> null
      - id         = "1500a076-d70e-48ac-a716-9a6154cd2813" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group.viewer will be destroyed
  # (because keycloak_group.viewer is not in configuration)
  - resource "keycloak_group" "viewer" {
      - attributes = {} -> null
      - id         = "e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings will be destroyed
  # (because keycloak_group_roles.admin_role_mappings is not in configuration)
  - resource "keycloak_group_roles" "admin_role_mappings" {
      - exhaustive = true -> null
      - group_id   = "1500a076-d70e-48ac-a716-9a6154cd2813" -> null
      - id         = "bcparks-service-transformation/1500a076-d70e-48ac-a716-9a6154cd2813" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "b879dfef-5bdc-47a7-98cb-e9e00e2779ca",
        ] -> null
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          - "df526cab-673e-4fb2-89e5-83c34a572a05",
          - "df5e19ad-8ee6-4e23-93df-f7960abfc055",
        ] -> null
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          - "df526cab-673e-4fb2-89e5-83c34a572a05",
          - "df5e19ad-8ee6-4e23-93df-f7960abfc055",
        ] -> null
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          - "df526cab-673e-4fb2-89e5-83c34a572a05",
          - "df5e19ad-8ee6-4e23-93df-f7960abfc055",
        ] -> null
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          - "df526cab-673e-4fb2-89e5-83c34a572a05",
          - "df5e19ad-8ee6-4e23-93df-f7960abfc055",
        ] -> null
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          - "df526cab-673e-4fb2-89e5-83c34a572a05",
          - "df5e19ad-8ee6-4e23-93df-f7960abfc055",
        ] -> null
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - id         = "bcparks-service-transformation/e88ed69a-b813-4a0a-bac4-acbcc9113458" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "8e395267-fd34-4ef9-bf80-0ea1be945fa1",
          - "df526cab-673e-4fb2-89e5-83c34a572a05",
          - "df5e19ad-8ee6-4e23-93df-f7960abfc055",
        ] -> null
    }

  # module.keycloak_dev.module.custom_clients.module.bcparks-service-transformation.keycloak_realm.this will be destroyed
  # (because keycloak_realm.this is not in configuration)
  - resource "keycloak_realm" "this" {
      - access_code_lifespan                     = "1m0s" -> null
      - access_code_lifespan_login               = "30m0s" -> null
      - access_code_lifespan_user_action         = "5m0s" -> null
      - access_token_lifespan                    = "5m0s" -> null
      - access_token_lifespan_for_implicit_flow  = "15m0s" -> null
      - action_token_generated_by_admin_lifespan = "12h0m0s" -> null
      - action_token_generated_by_user_lifespan  = "5m0s" -> null
      - attributes                               = {} -> null
      - browser_flow                             = "browser" -> null
      - client_authentication_flow               = "clients" -> null
      - client_session_idle_timeout              = "0s" -> null
      - client_session_max_lifespan              = "0s" -> null
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      - direct_grant_flow                        = "direct grant" -> null
      - docker_authentication_flow               = "docker auth" -> null
      - duplicate_emails_allowed                 = false -> null
      - edit_username_allowed                    = false -> null
      - enabled                                  = true -> null
      - id                                       = "bcparks-service-transformation" -> null
      - internal_id                              = "bcparks-service-transformation" -> null
      - login_with_email_allowed                 = false -> null
      - oauth2_device_code_lifespan              = "10m0s" -> null
      - oauth2_device_polling_interval           = 5 -> null
      - offline_session_idle_timeout             = "720h0m0s" -> null
      - offline_session_max_lifespan             = "1440h0m0s" -> null
      - offline_session_max_lifespan_enabled     = false -> null
      - realm                                    = "bcparks-service-transformation" -> null
      - refresh_token_max_reuse                  = 0 -> null
      - registration_allowed                     = false -> null
      - registration_email_as_username           = false -> null
      - registration_flow                        = "registration" -> null
      - remember_me                              = false -> null
      - reset_credentials_flow                   = "reset credentials" -> null
      - reset_password_allowed                   = false -> null
      - revoke_refresh_token                     = false -> null
      - ssl_required                             = "external" -> null
      - sso_session_idle_timeout                 = "30m0s" -> null
      - sso_session_idle_timeout_remember_me     = "0s" -> null
      - sso_session_max_lifespan                 = "10h0m0s" -> null
      - sso_session_max_lifespan_remember_me     = "0s" -> null
      - user_managed_access                      = false -> null
      - verify_email                             = false -> null

      - otp_policy {
          - algorithm         = "HmacSHA1" -> null
          - digits            = 6 -> null
          - initial_counter   = 0 -> null
          - look_ahead_window = 1 -> null
          - period            = 30 -> null
          - type              = "totp" -> null
        }

      - web_authn_passwordless_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }

      - web_authn_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.data.keycloak_openid_client.management_client will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "management_client"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.admin_role will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "admin_role"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin will be created
  + resource "keycloak_group" "admin" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer will be created
  + resource "keycloak_group" "viewer" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings will be created
  + resource "keycloak_group_roles" "admin_role_mappings" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "bcparks-service-transformation"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group.admin will be destroyed
  # (because keycloak_group.admin is not in configuration)
  - resource "keycloak_group" "admin" {
      - attributes = {} -> null
      - id         = "cdfeff16-cc12-4f6b-af9b-21a0c3638850" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group.viewer will be destroyed
  # (because keycloak_group.viewer is not in configuration)
  - resource "keycloak_group" "viewer" {
      - attributes = {} -> null
      - id         = "552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings will be destroyed
  # (because keycloak_group_roles.admin_role_mappings is not in configuration)
  - resource "keycloak_group_roles" "admin_role_mappings" {
      - exhaustive = true -> null
      - group_id   = "cdfeff16-cc12-4f6b-af9b-21a0c3638850" -> null
      - id         = "bcparks-service-transformation/cdfeff16-cc12-4f6b-af9b-21a0c3638850" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "2079d65c-c9e0-477f-8103-70807d5bb91d",
        ] -> null
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "9cabf49f-64b4-44a6-b54d-269cef349426",
        ] -> null
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "9cabf49f-64b4-44a6-b54d-269cef349426",
        ] -> null
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "9cabf49f-64b4-44a6-b54d-269cef349426",
        ] -> null
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "9cabf49f-64b4-44a6-b54d-269cef349426",
        ] -> null
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "9cabf49f-64b4-44a6-b54d-269cef349426",
        ] -> null
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - id         = "bcparks-service-transformation/552c0a44-4834-4071-8585-9fe2e6ea45d8" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "9cabf49f-64b4-44a6-b54d-269cef349426",
        ] -> null
    }

  # module.keycloak_prod.module.custom_clients.module.bcparks-service-transformation.keycloak_realm.this will be destroyed
  # (because keycloak_realm.this is not in configuration)
  - resource "keycloak_realm" "this" {
      - access_code_lifespan                     = "1m0s" -> null
      - access_code_lifespan_login               = "30m0s" -> null
      - access_code_lifespan_user_action         = "5m0s" -> null
      - access_token_lifespan                    = "5m0s" -> null
      - access_token_lifespan_for_implicit_flow  = "15m0s" -> null
      - action_token_generated_by_admin_lifespan = "12h0m0s" -> null
      - action_token_generated_by_user_lifespan  = "5m0s" -> null
      - attributes                               = {} -> null
      - browser_flow                             = "browser" -> null
      - client_authentication_flow               = "clients" -> null
      - client_session_idle_timeout              = "0s" -> null
      - client_session_max_lifespan              = "0s" -> null
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      - direct_grant_flow                        = "direct grant" -> null
      - docker_authentication_flow               = "docker auth" -> null
      - duplicate_emails_allowed                 = false -> null
      - edit_username_allowed                    = false -> null
      - enabled                                  = true -> null
      - id                                       = "bcparks-service-transformation" -> null
      - internal_id                              = "bcparks-service-transformation" -> null
      - login_with_email_allowed                 = false -> null
      - oauth2_device_code_lifespan              = "10m0s" -> null
      - oauth2_device_polling_interval           = 5 -> null
      - offline_session_idle_timeout             = "720h0m0s" -> null
      - offline_session_max_lifespan             = "1440h0m0s" -> null
      - offline_session_max_lifespan_enabled     = false -> null
      - realm                                    = "bcparks-service-transformation" -> null
      - refresh_token_max_reuse                  = 0 -> null
      - registration_allowed                     = false -> null
      - registration_email_as_username           = false -> null
      - registration_flow                        = "registration" -> null
      - remember_me                              = false -> null
      - reset_credentials_flow                   = "reset credentials" -> null
      - reset_password_allowed                   = false -> null
      - revoke_refresh_token                     = false -> null
      - ssl_required                             = "external" -> null
      - sso_session_idle_timeout                 = "30m0s" -> null
      - sso_session_idle_timeout_remember_me     = "0s" -> null
      - sso_session_max_lifespan                 = "10h0m0s" -> null
      - sso_session_max_lifespan_remember_me     = "0s" -> null
      - user_managed_access                      = false -> null
      - verify_email                             = false -> null

      - otp_policy {
          - algorithm         = "HmacSHA1" -> null
          - digits            = 6 -> null
          - initial_counter   = 0 -> null
          - look_ahead_window = 1 -> null
          - period            = 30 -> null
          - type              = "totp" -> null
        }

      - web_authn_passwordless_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }

      - web_authn_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.data.keycloak_openid_client.management_client will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "management_client"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.admin_role will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "admin_role"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin will be created
  + resource "keycloak_group" "admin" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer will be created
  + resource "keycloak_group" "viewer" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings will be created
  + resource "keycloak_group_roles" "admin_role_mappings" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "bcparks-service-transformation"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group.admin will be destroyed
  # (because keycloak_group.admin is not in configuration)
  - resource "keycloak_group" "admin" {
      - attributes = {} -> null
      - id         = "880ce9ff-f787-4de3-80b4-8dcb09202387" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group.viewer will be destroyed
  # (because keycloak_group.viewer is not in configuration)
  - resource "keycloak_group" "viewer" {
      - attributes = {} -> null
      - id         = "f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings will be destroyed
  # (because keycloak_group_roles.admin_role_mappings is not in configuration)
  - resource "keycloak_group_roles" "admin_role_mappings" {
      - exhaustive = true -> null
      - group_id   = "880ce9ff-f787-4de3-80b4-8dcb09202387" -> null
      - id         = "bcparks-service-transformation/880ce9ff-f787-4de3-80b4-8dcb09202387" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "1ac72e4e-5b0b-4b00-af50-efab590915e7",
        ] -> null
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "255faa28-f3d6-4d57-8514-4360bb69931f",
          - "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          - "44187847-e30c-4161-90dc-4f62816c4437",
          - "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          - "5a727130-8191-496d-83b7-1a81da9b54ff",
          - "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
        ] -> null
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "255faa28-f3d6-4d57-8514-4360bb69931f",
          - "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          - "44187847-e30c-4161-90dc-4f62816c4437",
          - "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          - "5a727130-8191-496d-83b7-1a81da9b54ff",
          - "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
        ] -> null
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "255faa28-f3d6-4d57-8514-4360bb69931f",
          - "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          - "44187847-e30c-4161-90dc-4f62816c4437",
          - "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          - "5a727130-8191-496d-83b7-1a81da9b54ff",
          - "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
        ] -> null
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "255faa28-f3d6-4d57-8514-4360bb69931f",
          - "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          - "44187847-e30c-4161-90dc-4f62816c4437",
          - "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          - "5a727130-8191-496d-83b7-1a81da9b54ff",
          - "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
        ] -> null
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "255faa28-f3d6-4d57-8514-4360bb69931f",
          - "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          - "44187847-e30c-4161-90dc-4f62816c4437",
          - "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          - "5a727130-8191-496d-83b7-1a81da9b54ff",
          - "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
        ] -> null
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - id         = "bcparks-service-transformation/f48b403d-e1de-4b00-8984-92d4ea334276" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "255faa28-f3d6-4d57-8514-4360bb69931f",
          - "426ddf71-8efd-4cf2-b9e4-4534c4d8b528",
          - "44187847-e30c-4161-90dc-4f62816c4437",
          - "51ed630b-1945-4819-aa3f-a88095e2cf3d",
          - "5a727130-8191-496d-83b7-1a81da9b54ff",
          - "f54868c9-18a5-4cfb-9e43-52c79729c6b9",
        ] -> null
    }

  # module.keycloak_test.module.custom_clients.module.bcparks-service-transformation.keycloak_realm.this will be destroyed
  # (because keycloak_realm.this is not in configuration)
  - resource "keycloak_realm" "this" {
      - access_code_lifespan                     = "1m0s" -> null
      - access_code_lifespan_login               = "30m0s" -> null
      - access_code_lifespan_user_action         = "5m0s" -> null
      - access_token_lifespan                    = "5m0s" -> null
      - access_token_lifespan_for_implicit_flow  = "15m0s" -> null
      - action_token_generated_by_admin_lifespan = "12h0m0s" -> null
      - action_token_generated_by_user_lifespan  = "5m0s" -> null
      - attributes                               = {} -> null
      - browser_flow                             = "browser" -> null
      - client_authentication_flow               = "clients" -> null
      - client_session_idle_timeout              = "0s" -> null
      - client_session_max_lifespan              = "0s" -> null
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      - direct_grant_flow                        = "direct grant" -> null
      - docker_authentication_flow               = "docker auth" -> null
      - duplicate_emails_allowed                 = false -> null
      - edit_username_allowed                    = false -> null
      - enabled                                  = true -> null
      - id                                       = "bcparks-service-transformation" -> null
      - internal_id                              = "bcparks-service-transformation" -> null
      - login_with_email_allowed                 = false -> null
      - oauth2_device_code_lifespan              = "10m0s" -> null
      - oauth2_device_polling_interval           = 5 -> null
      - offline_session_idle_timeout             = "720h0m0s" -> null
      - offline_session_max_lifespan             = "1440h0m0s" -> null
      - offline_session_max_lifespan_enabled     = false -> null
      - realm                                    = "bcparks-service-transformation" -> null
      - refresh_token_max_reuse                  = 0 -> null
      - registration_allowed                     = false -> null
      - registration_email_as_username           = false -> null
      - registration_flow                        = "registration" -> null
      - remember_me                              = false -> null
      - reset_credentials_flow                   = "reset credentials" -> null
      - reset_password_allowed                   = false -> null
      - revoke_refresh_token                     = false -> null
      - ssl_required                             = "external" -> null
      - sso_session_idle_timeout                 = "30m0s" -> null
      - sso_session_idle_timeout_remember_me     = "0s" -> null
      - sso_session_max_lifespan                 = "10h0m0s" -> null
      - sso_session_max_lifespan_remember_me     = "0s" -> null
      - user_managed_access                      = false -> null
      - verify_email                             = false -> null

      - otp_policy {
          - algorithm         = "HmacSHA1" -> null
          - digits            = 6 -> null
          - initial_counter   = 0 -> null
          - look_ahead_window = 1 -> null
          - period            = 30 -> null
          - type              = "totp" -> null
        }

      - web_authn_passwordless_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }

      - web_authn_policy {
          - acceptable_aaguids                = [] -> null
          - attestation_conveyance_preference = "not specified" -> null
          - authenticator_attachment          = "not specified" -> null
          - avoid_same_authenticator_register = false -> null
          - create_timeout                    = 0 -> null
          - relying_party_entity_name         = "keycloak" -> null
          - require_resident_key              = "not specified" -> null
          - signature_algorithms              = [
              - "ES256",
            ] -> null
          - user_verification_requirement     = "not specified" -> null
        }
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.data.keycloak_openid_client.management_client will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "management_client"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.admin_role will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "admin_role"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.data.keycloak_role.viewer_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin will be created
  + resource "keycloak_group" "admin" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer will be created
  + resource "keycloak_group" "viewer" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings will be created
  + resource "keycloak_group_roles" "admin_role_mappings" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "bcparks-service-transformation"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

Plan: 30 to add, 0 to change, 30 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @junminahn, Action: `pull_request`*